# KeyBasedTreeEntries Properties

---
The KeyBasedTreeEntries type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
KeyBasedTreeEntries Class
Autodesk.Revit.DB Namespace